# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArray..::..ForwardIterator Method
IntersectionResultArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IntersectionResultArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As IntersectionResultArrayIterator
```

Visual C++
---
```text
public:
virtual IntersectionResultArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace